app/Controllers/Home.php

    public function productos(): string
    {
        $data['titulo'] = "Todos los Productos";
        $data['categoria'] = "todos";
        $producto_model = new \App\Models\Producto_model();
        $data['productos'] = $producto_model
        ->where('estado_producto', 1)
        ->where('stock_producto >', 0)
        ->findAll();
---
SELECT *
FROM `productos`
WHERE `estado_producto` = 1
AND `stock_producto` > 0

public function categoria($nombreCategoria): string
{
    $data['titulo'] = ucfirst($nombreCategoria);
    $data['categoria'] = $nombreCategoria;

    // Buscar la categoría en la base de datos
    $categoria_model = new \App\Models\Categoria_producto_model();
    $categoria = $categoria_model->where('nombre_categoria', $nombreCategoria)->first();

    $producto_model = new \App\Models\Producto_model();

    if ($categoria) {
        // Si existe la categoría, filtra los productos por esa categoría
        $data['productos'] = $producto_model
            ->where('estado_producto', 1)
            ->where('stock_producto >', 0)
            ->where('categoria_producto', $categoria['id_categoria'])
            ->findAll();
---
SELECT *
FROM `productos`
WHERE `estado_producto` = 1
AND `stock_producto` > 0
AND `categoria_producto` = '3'