app/Controllers/Producto_Controller.php

    function gestionar_productos(){
        $producto_model = new Producto_model();
        $categorias = new Categoria_producto_model();

        $data['productos']=$producto_model->join('categoria_producto', 'categoria_producto.id_categoria = productos.categoria_producto')->findAll();
---
SELECT *
FROM `productos`
JOIN `categoria_producto` ON `categoria_producto`.`id_categoria` = `productos`.`categoria_producto`