app/Controllers/Usuarios_Controller.php

INSERT INTO `usuarios` (`nombre_usuario`, `apellido_usuario`, `mail_usuario`, `telefono_usuario`, `contrasenia_usuario`, `id_perfil`, `estado_usuario`) VALUES ('nata', 'ziga', 'lala@gmial.com', '123454532', '$2y$10$dSiPfaLoEatDwU6WT016/u6MELsGOayPs31IAf/8.TGtOSgWt2ElO', 2, 1)
---
            ];

            $registro_usuario = new Usuarios_model();
            $registro_usuario->insert($data);

SELECT *
FROM `usuarios`
WHERE `mail_usuario` = 'lucas123@gmail.com'
 LIMIT 1
---
    $password = $request->getPost('password');

    $userModel = new Usuarios_model();
    $user = $userModel->where('mail_usuario', $email)->first();