app/Controllers/Ventas_Controller.php

   public function listar_ventas()
   {

    $venta = new Venta_model();

    $data['titulo'] = 'Listar ventas';

    $data['ventas'] = $venta->select('venta.*, usuarios.nombre_usuario, usuarios.apellido_usuario')
                            ->join('usuarios', 'usuarios.id_usuario = venta.id_usuario')
                            ->findAll();
---
SELECT `venta`.*, `usuarios`.`nombre_usuario`, `usuarios`.`apellido_usuario`
FROM `venta`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `venta`.`id_usuario`

public function listar_detalle_ventas($id = null){
    $venta = new Venta_model();
    $detalle_venta = new Detalle_venta_model();

    $data['titulo'] = 'Listar detalle de ventas';

    $data['ventas'] = $venta
        ->select('venta.*, usuarios.nombre_usuario, usuarios.apellido_usuario, usuarios.mail_usuario')
        ->join('usuarios','usuarios.id_usuario = venta.id_usuario')
        ->where('id_venta', $id)
        ->first();

    $data['detalle'] = $detalle_venta
        ->select('detalle_venta.*, productos.descripcion_producto, productos.precio_producto')
        ->join('productos','productos.id_producto = detalle_venta.id_producto')
        ->where('id_venta', $id)
        ->findAll();
---
SELECT `venta`.*, `usuarios`.`nombre_usuario`, `usuarios`.`apellido_usuario`, `usuarios`.`mail_usuario`
FROM `venta`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `venta`.`id_usuario`
WHERE `id_venta` = '3'
 LIMIT 1
SELECT `detalle_venta`.*, `productos`.`descripcion_producto`, `productos`.`precio_producto`
FROM `detalle_venta`
JOIN `productos` ON `productos`.`id_producto` = `detalle_venta`.`id_producto`
WHERE `id_venta` = '3'